backend/performance-tests/resource-service.yml
config:
  target: "http://localhost:5004"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 10
      name: "Warm-up"
    - duration: 60
      arrivalRate: 10
      name: "Sustained Load"
    - duration: 30
      arrivalRate: 30
      name: "Stress Spike"
  defaults:
    headers:
      Content-Type: "application/json"
  ensure:
    p99: 1000
    maxErrorRate: 1

scenarios:
  - name: "Health Check"
    weight: 5
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200

  - name: "List Resources"
    weight: 40
    flow:
      - get:
          url: "/api/resources"
          expect:
            - statusCode: 200

  - name: "Resources with Filters"
    weight: 30
    flow:
      - get:
          url: "/api/resources?type=guide&category=leadership-skills"
          expect:
            - statusCode: 200
      - get:
          url: "/api/resources?difficulty=beginner&page=1&limit=10"
          expect:
            - statusCode: 200

  - name: "Resource Detail"
    weight: 25
    flow:
      - get:
          url: "/api/resources"
          capture:
            - json: "$.data[0]._id"
              as: "resourceId"
      - get:
          url: "/api/resources/{{ resourceId }}"